#Напишите программу, которая определяет, какой температуре по шкале Цельсия соответствует указанное значение по шкале Фаренгейта.
f = float(input())
c = (5/9)*(f-32)
print(c)
